/* This is a mapping of BRError code failures to localized recovery suggestions */

/* kBRMediaPlayerSongPlaybackError*/
201 = "Para voltar ao ecrã anterior, prima o botão Menu.";

/* kBRMediaPlayerNotResponding*/
202 = "Para voltar ao ecrã anterior, prima o botão Menu.";


/* kBRMediaNoMovieFolderContent */
304 = "Certifique-se de que os filmes que cria ou descarrega se encontram na pasta Filmes, dentro da sua pasta pessoal.";

/* kBRMediaEmptyPlaylist */
310 = "";

/* kBRMediaNoSuchPlaylist */
311 = "Seleccionar outra lista de reprodução.";

/* kBRMediaNoSuchSong */
312 = "Seleccionar outra música";

/* kBRMediaNoSongForSlideshow */
316 = "Verifique as definições de música do diaporama e volte a tentar.";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "Verifique as definições de música do diaporama e volte a tentar.";

/* kBRVideoUnplayable */
318 = "O formato não foi reconhecido.";

/* kBRMediaRadioStreamUnplayable */
319 = "O stream de rádio excedeu o tempo limite antes de poder ser reproduzido.";


/* kBRRemoteMediaNoContent*/
350 = "";

/* kBRRemoteMediaNoPhotoContent */
351 = "";

/* kBRRemoteMediaNoPodcastContent */
352 = "";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "";

/* kBRRemoteMediaNoTVShowContent */
355 = "";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "";

/* kBRRemoteMediaNoPlaylists */
357 = "";

/* kBRRemoteMediaNoSongContent */
358 = "";

/* kBRRemoteMediaNoAudioBookContent */
359 = "";

/* kBRRemoteMediaEmptyPlaylist */
360 = "";

/* kBRRemoteMediaLoadingError */
361 = "Verifique a origem ou tente novamente mais tarde.";

/* kBRRemotePhotoSourceUnavailableError */
363 = "Verifique a origem ou tente novamente mais tarde.";

/* kBRDataSourceConnectionInProgressError */
420 = "Aguarde, por favor.";

/* KBRSystemNetworkHostUnreachable */
501 = "Verifique a configuração da rede e a ligação.";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "O site de trailers cinematográficos da Apple está indisponível. Tente novamente, mais tarde.";

/* kBRSystemNotHDCPCompliant */
503 = "Para ver este conteúdo, certifique-se de que o ecrã ligado suporta HDCP.";

/* kBRSetupCantSetLanguage */
600 = "Voltar a tentar.";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "Um DVD está a ser reproduzido por outra aplicação. Volte à secretária para encerrar a outra aplicação e tente de novo.";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "O DVD está a ser reproduzido por outra aplicação. Volte à secretária para sair da outra aplicação.";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "Para mais informações sobre os códigos de região, consulte a ajuda do Leitor de DVD.";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "O formato não foi reconhecido.";

/* kBRDVDErrorFatalDVDAlert */
754 = "Ocorreu um problema no disco.";

/* kBRCDErrorCantEjectCDAlert */
755 = "Um CD está a ser utilizado por outra aplicação. Volte à secretária para encerrar a outra aplicação e tente de novo.";


/* kBRInternalResourceError */
900 = "";


